; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob41) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 crate15 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate11)
	(at pallet3 distributor0)
	(clear crate8)
	(at pallet4 distributor1)
	(clear crate10)
	(at pallet5 distributor2)
	(clear crate12)
	(at pallet6 depot0)
	(clear crate5)
	(at pallet7 depot0)
	(clear crate14)
	(at pallet8 depot0)
	(clear pallet8)
	(at pallet9 depot0)
	(clear crate1)
	(at pallet10 depot2)
	(clear crate2)
	(at pallet11 depot2)
	(clear crate15)
	(at pallet12 depot1)
	(clear crate4)
	(at pallet13 distributor2)
	(clear pallet13)
	(at truck0 distributor0)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 depot1)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 depot1)
	(available hoist10)
	(at hoist11 distributor2)
	(available hoist11)
	(at crate0 depot0)
	(on crate0 pallet9)
	(at crate1 depot0)
	(on crate1 crate0)
	(at crate2 depot2)
	(on crate2 pallet10)
	(at crate3 depot1)
	(on crate3 pallet12)
	(at crate4 depot1)
	(on crate4 crate3)
	(at crate5 depot0)
	(on crate5 pallet6)
	(at crate6 distributor2)
	(on crate6 pallet5)
	(at crate7 distributor1)
	(on crate7 pallet4)
	(at crate8 distributor0)
	(on crate8 pallet3)
	(at crate9 depot2)
	(on crate9 pallet11)
	(at crate10 distributor1)
	(on crate10 crate7)
	(at crate11 depot2)
	(on crate11 pallet2)
	(at crate12 distributor2)
	(on crate12 crate6)
	(at crate13 depot2)
	(on crate13 crate9)
	(at crate14 depot0)
	(on crate14 pallet7)
	(at crate15 depot2)
	(on crate15 crate13)
)

(:goal (and
		(on crate0 pallet12)
		(on crate1 crate2)
		(on crate2 pallet5)
		(on crate4 pallet9)
		(on crate5 pallet6)
		(on crate6 crate8)
		(on crate7 pallet13)
		(on crate8 pallet7)
		(on crate9 crate6)
		(on crate10 pallet4)
		(on crate11 crate12)
		(on crate12 crate1)
		(on crate13 crate4)
		(on crate14 crate7)
		(on crate15 pallet0)
	)
))

; plan
1. (lift hoist6 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist6) (on crate1 crate0)
   added: (lifting hoist6 crate1) (clear crate0)
   goals met: 1 of 15
2. (load hoist6 crate1 truck1 depot0)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck1) (available hoist6)
   goals met: 1 of 15
3. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 1 of 15
4. (lift hoist7 crate0 pallet9 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist7) (on crate0 pallet9)
   added: (lifting hoist7 crate0) (clear pallet9)
   goals met: 1 of 15
5. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 1 of 15
6. (load hoist7 crate0 truck0 depot0)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck0) (available hoist7)
   goals met: 1 of 15
7. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 1 of 15
8. (unload hoist8 crate0 truck0 depot1)
   deleted: (in crate0 truck0) (available hoist8)
   added: (lifting hoist8 crate0)
   goals met: 1 of 15
9. (lift hoist4 crate10 crate7 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate7)
   added: (lifting hoist4 crate10) (clear crate7)
   goals met: 1 of 15
10. (lift hoist5 crate12 crate6 distributor2)
   deleted: (at crate12 distributor2) (clear crate12) (available hoist5) (on crate12 crate6)
   added: (lifting hoist5 crate12) (clear crate6)
   goals met: 1 of 15
11. (lift hoist7 crate14 pallet7 depot0)
   deleted: (at crate14 depot0) (clear crate14) (available hoist7) (on crate14 pallet7)
   added: (lifting hoist7 crate14) (clear pallet7)
   goals met: 1 of 15
12. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 1 of 15
13. (load hoist7 crate14 truck0 depot0)
   deleted: (lifting hoist7 crate14)
   added: (in crate14 truck0) (available hoist7)
   goals met: 1 of 15
14. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 1 of 15
15. (lift hoist10 crate4 crate3 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist10) (on crate4 crate3)
   added: (lifting hoist10 crate4) (clear crate3)
   goals met: 1 of 15
16. (lift hoist1 crate3 pallet12 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 pallet12)
   added: (lifting hoist1 crate3) (clear pallet12)
   goals met: 1 of 15
17. (drop hoist8 crate0 pallet12 depot1)
   deleted: (lifting hoist8 crate0) (clear pallet12)
   added: (available hoist8) (at crate0 depot1) (clear crate0) (on crate0 pallet12)
   goals met: 2 of 15
18. (lift hoist9 crate7 pallet4 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist9) (on crate7 pallet4)
   added: (lifting hoist9 crate7) (clear pallet4)
   goals met: 2 of 15
19. (drop hoist4 crate10 pallet4 distributor1)
   deleted: (lifting hoist4 crate10) (clear pallet4)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 pallet4)
   goals met: 3 of 15
20. (unload hoist4 crate14 truck0 distributor1)
   deleted: (in crate14 truck0) (available hoist4)
   added: (lifting hoist4 crate14)
   goals met: 3 of 15
21. (drop hoist9 crate7 crate10 distributor1)
   deleted: (lifting hoist9 crate7) (clear crate10)
   added: (available hoist9) (at crate7 distributor1) (clear crate7) (on crate7 crate10)
   goals met: 3 of 15
22. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 3 of 15
23. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 3 of 15
24. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 3 of 15
25. (load hoist10 crate4 truck0 depot1)
   deleted: (lifting hoist10 crate4)
   added: (in crate4 truck0) (available hoist10)
   goals met: 3 of 15
26. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 3 of 15
27. (unload hoist7 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist7)
   added: (lifting hoist7 crate4)
   goals met: 3 of 15
28. (drop hoist7 crate4 pallet9 depot0)
   deleted: (lifting hoist7 crate4) (clear pallet9)
   added: (available hoist7) (at crate4 depot0) (clear crate4) (on crate4 pallet9)
   goals met: 4 of 15
29. (lift hoist9 crate7 crate10 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist9) (on crate7 crate10)
   added: (lifting hoist9 crate7) (clear crate10)
   goals met: 4 of 15
30. (lift hoist3 crate8 pallet3 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 pallet3)
   added: (lifting hoist3 crate8) (clear pallet3)
   goals met: 4 of 15
31. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 4 of 15
32. (load hoist3 crate8 truck0 distributor0)
   deleted: (lifting hoist3 crate8)
   added: (in crate8 truck0) (available hoist3)
   goals met: 4 of 15
33. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 4 of 15
34. (unload hoist7 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist7)
   added: (lifting hoist7 crate8)
   goals met: 4 of 15
35. (drop hoist7 crate8 pallet7 depot0)
   deleted: (lifting hoist7 crate8) (clear pallet7)
   added: (available hoist7) (at crate8 depot0) (clear crate8) (on crate8 pallet7)
   goals met: 5 of 15
36. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 5 of 15
37. (drop hoist9 crate7 crate10 distributor1)
   deleted: (lifting hoist9 crate7) (clear crate10)
   added: (available hoist9) (at crate7 distributor1) (clear crate7) (on crate7 crate10)
   goals met: 5 of 15
38. (lift hoist2 crate15 crate13 depot2)
   deleted: (at crate15 depot2) (clear crate15) (available hoist2) (on crate15 crate13)
   added: (lifting hoist2 crate15) (clear crate13)
   goals met: 5 of 15
39. (load hoist2 crate15 truck1 depot2)
   deleted: (lifting hoist2 crate15)
   added: (in crate15 truck1) (available hoist2)
   goals met: 5 of 15
40. (lift hoist2 crate13 crate9 depot2)
   deleted: (at crate13 depot2) (clear crate13) (available hoist2) (on crate13 crate9)
   added: (lifting hoist2 crate13) (clear crate9)
   goals met: 5 of 15
41. (load hoist2 crate13 truck1 depot2)
   deleted: (lifting hoist2 crate13)
   added: (in crate13 truck1) (available hoist2)
   goals met: 5 of 15
42. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 5 of 15
43. (unload hoist7 crate13 truck1 depot0)
   deleted: (in crate13 truck1) (available hoist7)
   added: (lifting hoist7 crate13)
   goals met: 5 of 15
44. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 5 of 15
45. (drop hoist7 crate13 crate4 depot0)
   deleted: (lifting hoist7 crate13) (clear crate4)
   added: (available hoist7) (at crate13 depot0) (clear crate13) (on crate13 crate4)
   goals met: 6 of 15
46. (unload hoist2 crate1 truck1 depot2)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   goals met: 6 of 15
47. (drop hoist2 crate1 crate2 depot2)
   deleted: (lifting hoist2 crate1) (clear crate2)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 crate2)
   goals met: 7 of 15
48. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 7 of 15
49. (load hoist5 crate12 truck1 distributor2)
   deleted: (lifting hoist5 crate12)
   added: (in crate12 truck1) (available hoist5)
   goals met: 7 of 15
50. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 7 of 15
51. (unload hoist2 crate12 truck1 depot2)
   deleted: (in crate12 truck1) (available hoist2)
   added: (lifting hoist2 crate12)
   goals met: 7 of 15
52. (drop hoist2 crate12 crate1 depot2)
   deleted: (lifting hoist2 crate12) (clear crate1)
   added: (available hoist2) (at crate12 depot2) (clear crate12) (on crate12 crate1)
   goals met: 8 of 15
53. (lift hoist5 crate6 pallet5 distributor2)
   deleted: (at crate6 distributor2) (clear crate6) (available hoist5) (on crate6 pallet5)
   added: (lifting hoist5 crate6) (clear pallet5)
   goals met: 8 of 15
54. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 8 of 15
55. (load hoist5 crate6 truck1 distributor2)
   deleted: (lifting hoist5 crate6)
   added: (in crate6 truck1) (available hoist5)
   goals met: 8 of 15
56. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 8 of 15
57. (unload hoist7 crate15 truck1 depot0)
   deleted: (in crate15 truck1) (available hoist7)
   added: (lifting hoist7 crate15)
   goals met: 8 of 15
58. (unload hoist6 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist6)
   added: (lifting hoist6 crate6)
   goals met: 8 of 15
59. (drop hoist7 crate15 pallet0 depot0)
   deleted: (lifting hoist7 crate15) (clear pallet0)
   added: (available hoist7) (at crate15 depot0) (clear crate15) (on crate15 pallet0)
   goals met: 9 of 15
60. (drop hoist6 crate6 crate8 depot0)
   deleted: (lifting hoist6 crate6) (clear crate8)
   added: (available hoist6) (at crate6 depot0) (clear crate6) (on crate6 crate8)
   goals met: 10 of 15
61. (lift hoist9 crate7 crate10 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist9) (on crate7 crate10)
   added: (lifting hoist9 crate7) (clear crate10)
   goals met: 10 of 15
62. (load hoist9 crate7 truck0 distributor1)
   deleted: (lifting hoist9 crate7)
   added: (in crate7 truck0) (available hoist9)
   goals met: 10 of 15
63. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 10 of 15
64. (unload hoist5 crate7 truck0 distributor2)
   deleted: (in crate7 truck0) (available hoist5)
   added: (lifting hoist5 crate7)
   goals met: 10 of 15
65. (drop hoist5 crate7 pallet13 distributor2)
   deleted: (lifting hoist5 crate7) (clear pallet13)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 pallet13)
   goals met: 11 of 15
66. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 11 of 15
67. (load hoist4 crate14 truck0 distributor1)
   deleted: (lifting hoist4 crate14)
   added: (in crate14 truck0) (available hoist4)
   goals met: 11 of 15
68. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 11 of 15
69. (unload hoist5 crate14 truck0 distributor2)
   deleted: (in crate14 truck0) (available hoist5)
   added: (lifting hoist5 crate14)
   goals met: 11 of 15
70. (drop hoist5 crate14 crate7 distributor2)
   deleted: (lifting hoist5 crate14) (clear crate7)
   added: (available hoist5) (at crate14 distributor2) (clear crate14) (on crate14 crate7)
   goals met: 12 of 15
71. (lift hoist2 crate11 pallet2 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist2) (on crate11 pallet2)
   added: (lifting hoist2 crate11) (clear pallet2)
   goals met: 12 of 15
72. (drop hoist2 crate11 crate12 depot2)
   deleted: (lifting hoist2 crate11) (clear crate12)
   added: (available hoist2) (at crate11 depot2) (clear crate11) (on crate11 crate12)
   goals met: 13 of 15
73. (lift hoist2 crate9 pallet11 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist2) (on crate9 pallet11)
   added: (lifting hoist2 crate9) (clear pallet11)
   goals met: 13 of 15
74. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 13 of 15
75. (load hoist2 crate9 truck0 depot2)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   goals met: 13 of 15
76. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 13 of 15
77. (unload hoist7 crate9 truck0 depot0)
   deleted: (in crate9 truck0) (available hoist7)
   added: (lifting hoist7 crate9)
   goals met: 13 of 15
78. (drop hoist7 crate9 crate6 depot0)
   deleted: (lifting hoist7 crate9) (clear crate6)
   added: (available hoist7) (at crate9 depot0) (clear crate9) (on crate9 crate6)
   goals met: 14 of 15
79. (lift hoist2 crate11 crate12 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist2) (on crate11 crate12)
   added: (lifting hoist2 crate11) (clear crate12)
   goals met: 13 of 15
80. (drop hoist2 crate11 pallet2 depot2)
   deleted: (lifting hoist2 crate11) (clear pallet2)
   added: (available hoist2) (at crate11 depot2) (clear crate11) (on crate11 pallet2)
   goals met: 13 of 15
81. (lift hoist2 crate12 crate1 depot2)
   deleted: (at crate12 depot2) (clear crate12) (available hoist2) (on crate12 crate1)
   added: (lifting hoist2 crate12) (clear crate1)
   goals met: 12 of 15
82. (drop hoist2 crate12 pallet11 depot2)
   deleted: (lifting hoist2 crate12) (clear pallet11)
   added: (available hoist2) (at crate12 depot2) (clear crate12) (on crate12 pallet11)
   goals met: 12 of 15
83. (lift hoist2 crate11 pallet2 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist2) (on crate11 pallet2)
   added: (lifting hoist2 crate11) (clear pallet2)
   goals met: 12 of 15
84. (drop hoist2 crate11 crate12 depot2)
   deleted: (lifting hoist2 crate11) (clear crate12)
   added: (available hoist2) (at crate11 depot2) (clear crate11) (on crate11 crate12)
   goals met: 13 of 15
85. (lift hoist2 crate1 crate2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist2) (on crate1 crate2)
   added: (lifting hoist2 crate1) (clear crate2)
   goals met: 12 of 15
86. (drop hoist2 crate1 pallet2 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 pallet2)
   goals met: 12 of 15
87. (lift hoist2 crate2 pallet10 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 pallet10)
   added: (lifting hoist2 crate2) (clear pallet10)
   goals met: 12 of 15
88. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 12 of 15
89. (load hoist2 crate2 truck0 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   goals met: 12 of 15
90. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 12 of 15
91. (unload hoist5 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist5)
   added: (lifting hoist5 crate2)
   goals met: 12 of 15
92. (drop hoist5 crate2 pallet5 distributor2)
   deleted: (lifting hoist5 crate2) (clear pallet5)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 13 of 15
93. (lift hoist2 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   goals met: 13 of 15
94. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 13 of 15
95. (load hoist2 crate1 truck0 depot2)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck0) (available hoist2)
   goals met: 13 of 15
96. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 13 of 15
97. (unload hoist5 crate1 truck0 distributor2)
   deleted: (in crate1 truck0) (available hoist5)
   added: (lifting hoist5 crate1)
   goals met: 13 of 15
98. (drop hoist5 crate1 crate2 distributor2)
   deleted: (lifting hoist5 crate1) (clear crate2)
   added: (available hoist5) (at crate1 distributor2) (clear crate1) (on crate1 crate2)
   goals met: 14 of 15
99. (lift hoist2 crate11 crate12 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist2) (on crate11 crate12)
   added: (lifting hoist2 crate11) (clear crate12)
   goals met: 13 of 15
100. (drop hoist2 crate11 pallet2 depot2)
   deleted: (lifting hoist2 crate11) (clear pallet2)
   added: (available hoist2) (at crate11 depot2) (clear crate11) (on crate11 pallet2)
   goals met: 13 of 15
101. (lift hoist2 crate12 pallet11 depot2)
   deleted: (at crate12 depot2) (clear crate12) (available hoist2) (on crate12 pallet11)
   added: (lifting hoist2 crate12) (clear pallet11)
   goals met: 13 of 15
102. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 13 of 15
103. (load hoist2 crate12 truck0 depot2)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck0) (available hoist2)
   goals met: 13 of 15
104. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 13 of 15
105. (unload hoist5 crate12 truck0 distributor2)
   deleted: (in crate12 truck0) (available hoist5)
   added: (lifting hoist5 crate12)
   goals met: 13 of 15
106. (drop hoist5 crate12 crate1 distributor2)
   deleted: (lifting hoist5 crate12) (clear crate1)
   added: (available hoist5) (at crate12 distributor2) (clear crate12) (on crate12 crate1)
   goals met: 14 of 15
107. (lift hoist2 crate11 pallet2 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist2) (on crate11 pallet2)
   added: (lifting hoist2 crate11) (clear pallet2)
   goals met: 14 of 15
108. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 14 of 15
109. (load hoist2 crate11 truck0 depot2)
   deleted: (lifting hoist2 crate11)
   added: (in crate11 truck0) (available hoist2)
   goals met: 14 of 15
110. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 14 of 15
111. (unload hoist5 crate11 truck0 distributor2)
   deleted: (in crate11 truck0) (available hoist5)
   added: (lifting hoist5 crate11)
   goals met: 14 of 15
112. (drop hoist5 crate11 crate12 distributor2)
   deleted: (lifting hoist5 crate11) (clear crate12)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 crate12)
   goals met: 15 of 15
